Microchip-MPLAB-Harmony/csp/apps/adc/adc_automatic_window_comparison/firmware/src/packs/ATSAMA5D27_DFP/component/flexcom.h
/* -------- FLEX_US_IER : (FLEXCOM Offset: 0x208) ( /W 32) USART Interrupt Enable Register -------- */
#define FLEX_US_IER_RXRDY_Pos                 _U_(0)                                               /**< (FLEX_US_IER) RXRDY Interrupt Enable Position */
#define FLEX_US_IER_RXRDY_Msk                 (_U_(0x1) << FLEX_US_IER_RXRDY_Pos)                  /**< (FLEX_US_IER) RXRDY Interrupt Enable Mask */
#define FLEX_US_IER_RXRDY(value)              (FLEX_US_IER_RXRDY_Msk & ((value) << FLEX_US_IER_RXRDY_Pos))
#define FLEX_US_IER_TXRDY_Pos                 _U_(1)                                               /**< (FLEX_US_IER) TXRDY Interrupt Enable Position */
#define FLEX_US_IER_TXRDY_Msk                 (_U_(0x1) << FLEX_US_IER_TXRDY_Pos)                  /**< (FLEX_US_IER) TXRDY Interrupt Enable Mask */
#define FLEX_US_IER_TXRDY(value)              (FLEX_US_IER_TXRDY_Msk & ((value) << FLEX_US_IER_TXRDY_Pos))
#define FLEX_US_IER_RXBRK_Pos                 _U_(2)                                               /**< (FLEX_US_IER) Receiver Break Interrupt Enable Position */
#define FLEX_US_IER_RXBRK_Msk                 (_U_(0x1) << FLEX_US_IER_RXBRK_Pos)                  /**< (FLEX_US_IER) Receiver Break Interrupt Enable Mask */
#define FLEX_US_IER_RXBRK(value)              (FLEX_US_IER_RXBRK_Msk & ((value) << FLEX_US_IER_RXBRK_Pos))
#define FLEX_US_IER_OVRE_Pos                  _U_(5)                                               /**< (FLEX_US_IER) Overrun Error Interrupt Enable Position */
#define FLEX_US_IER_OVRE_Msk                  (_U_(0x1) << FLEX_US_IER_OVRE_Pos)                   /**< (FLEX_US_IER) Overrun Error Interrupt Enable Mask */
#define FLEX_US_IER_OVRE(value)               (FLEX_US_IER_OVRE_Msk & ((value) << FLEX_US_IER_OVRE_Pos))
#define FLEX_US_IER_FRAME_Pos                 _U_(6)                                               /**< (FLEX_US_IER) Framing Error Interrupt Enable Position */
#define FLEX_US_IER_FRAME_Msk                 (_U_(0x1) << FLEX_US_IER_FRAME_Pos)                  /**< (FLEX_US_IER) Framing Error Interrupt Enable Mask */
#define FLEX_US_IER_FRAME(value)              (FLEX_US_IER_FRAME_Msk & ((value) << FLEX_US_IER_FRAME_Pos))
#define FLEX_US_IER_PARE_Pos                  _U_(7)                                               /**< (FLEX_US_IER) Parity Error Interrupt Enable Position */
#define FLEX_US_IER_PARE_Msk                  (_U_(0x1) << FLEX_US_IER_PARE_Pos)                   /**< (FLEX_US_IER) Parity Error Interrupt Enable Mask */
#define FLEX_US_IER_PARE(value)               (FLEX_US_IER_PARE_Msk & ((value) << FLEX_US_IER_PARE_Pos))
#define FLEX_US_IER_TIMEOUT_Pos               _U_(8)                                               /**< (FLEX_US_IER) Timeout Interrupt Enable Position */
#define FLEX_US_IER_TIMEOUT_Msk               (_U_(0x1) << FLEX_US_IER_TIMEOUT_Pos)                /**< (FLEX_US_IER) Timeout Interrupt Enable Mask */
#define FLEX_US_IER_TIMEOUT(value)            (FLEX_US_IER_TIMEOUT_Msk & ((value) << FLEX_US_IER_TIMEOUT_Pos))
#define FLEX_US_IER_TXEMPTY_Pos               _U_(9)                                               /**< (FLEX_US_IER) TXEMPTY Interrupt Enable Position */
#define FLEX_US_IER_TXEMPTY_Msk               (_U_(0x1) << FLEX_US_IER_TXEMPTY_Pos)                /**< (FLEX_US_IER) TXEMPTY Interrupt Enable Mask */
#define FLEX_US_IER_TXEMPTY(value)            (FLEX_US_IER_TXEMPTY_Msk & ((value) << FLEX_US_IER_TXEMPTY_Pos))
#define FLEX_US_IER_ITER_Pos                  _U_(10)                                              /**< (FLEX_US_IER) Max number of Repetitions Reached Interrupt Enable Position */
#define FLEX_US_IER_ITER_Msk                  (_U_(0x1) << FLEX_US_IER_ITER_Pos)                   /**< (FLEX_US_IER) Max number of Repetitions Reached Interrupt Enable Mask */
#define FLEX_US_IER_ITER(value)               (FLEX_US_IER_ITER_Msk & ((value) << FLEX_US_IER_ITER_Pos))
#define FLEX_US_IER_NACK_Pos                  _U_(13)                                              /**< (FLEX_US_IER) Non Acknowledge Interrupt Enable Position */
#define FLEX_US_IER_NACK_Msk                  (_U_(0x1) << FLEX_US_IER_NACK_Pos)                   /**< (FLEX_US_IER) Non Acknowledge Interrupt Enable Mask */
#define FLEX_US_IER_NACK(value)               (FLEX_US_IER_NACK_Msk & ((value) << FLEX_US_IER_NACK_Pos))
#define FLEX_US_IER_CTSIC_Pos                 _U_(19)                                              /**< (FLEX_US_IER) Clear to Send Input Change Interrupt Enable Position */
#define FLEX_US_IER_CTSIC_Msk                 (_U_(0x1) << FLEX_US_IER_CTSIC_Pos)                  /**< (FLEX_US_IER) Clear to Send Input Change Interrupt Enable Mask */
#define FLEX_US_IER_CTSIC(value)              (FLEX_US_IER_CTSIC_Msk & ((value) << FLEX_US_IER_CTSIC_Pos))
#define FLEX_US_IER_CMP_Pos                   _U_(22)                                              /**< (FLEX_US_IER) Comparison Interrupt Enable Position */
#define FLEX_US_IER_CMP_Msk                   (_U_(0x1) << FLEX_US_IER_CMP_Pos)                    /**< (FLEX_US_IER) Comparison Interrupt Enable Mask */
#define FLEX_US_IER_CMP(value)                (FLEX_US_IER_CMP_Msk & ((value) << FLEX_US_IER_CMP_Pos))
#define FLEX_US_IER_MANE_Pos                  _U_(24)                                              /**< (FLEX_US_IER) Manchester Error Interrupt Enable Position */
#define FLEX_US_IER_MANE_Msk                  (_U_(0x1) << FLEX_US_IER_MANE_Pos)                   /**< (FLEX_US_IER) Manchester Error Interrupt Enable Mask */
#define FLEX_US_IER_MANE(value)               (FLEX_US_IER_MANE_Msk & ((value) << FLEX_US_IER_MANE_Pos))
#define FLEX_US_IER_Msk                       _U_(0x014827E7)                                      /**< (FLEX_US_IER) Register Mask  */

/* SPI mode */
#define FLEX_US_IER_SPI_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IER_SPI) Register Mask  */

/* LIN mode */
#define FLEX_US_IER_LIN_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IER_LIN) Register Mask  */


/* -------- FLEX_US_IDR : (FLEXCOM Offset: 0x20C) ( /W 32) USART Interrupt Disable Register -------- */
#define FLEX_US_IDR_RXRDY_Pos                 _U_(0)                                               /**< (FLEX_US_IDR) RXRDY Interrupt Disable Position */
#define FLEX_US_IDR_RXRDY_Msk                 (_U_(0x1) << FLEX_US_IDR_RXRDY_Pos)                  /**< (FLEX_US_IDR) RXRDY Interrupt Disable Mask */
#define FLEX_US_IDR_RXRDY(value)              (FLEX_US_IDR_RXRDY_Msk & ((value) << FLEX_US_IDR_RXRDY_Pos))
#define FLEX_US_IDR_TXRDY_Pos                 _U_(1)                                               /**< (FLEX_US_IDR) TXRDY Interrupt Disable Position */
#define FLEX_US_IDR_TXRDY_Msk                 (_U_(0x1) << FLEX_US_IDR_TXRDY_Pos)                  /**< (FLEX_US_IDR) TXRDY Interrupt Disable Mask */
#define FLEX_US_IDR_TXRDY(value)              (FLEX_US_IDR_TXRDY_Msk & ((value) << FLEX_US_IDR_TXRDY_Pos))
#define FLEX_US_IDR_RXBRK_Pos                 _U_(2)                                               /**< (FLEX_US_IDR) Receiver Break Interrupt Disable Position */
#define FLEX_US_IDR_RXBRK_Msk                 (_U_(0x1) << FLEX_US_IDR_RXBRK_Pos)                  /**< (FLEX_US_IDR) Receiver Break Interrupt Disable Mask */
#define FLEX_US_IDR_RXBRK(value)              (FLEX_US_IDR_RXBRK_Msk & ((value) << FLEX_US_IDR_RXBRK_Pos))
#define FLEX_US_IDR_OVRE_Pos                  _U_(5)                                               /**< (FLEX_US_IDR) Overrun Error Interrupt Enable Position */
#define FLEX_US_IDR_OVRE_Msk                  (_U_(0x1) << FLEX_US_IDR_OVRE_Pos)                   /**< (FLEX_US_IDR) Overrun Error Interrupt Enable Mask */
#define FLEX_US_IDR_OVRE(value)               (FLEX_US_IDR_OVRE_Msk & ((value) << FLEX_US_IDR_OVRE_Pos))
#define FLEX_US_IDR_FRAME_Pos                 _U_(6)                                               /**< (FLEX_US_IDR) Framing Error Interrupt Disable Position */
#define FLEX_US_IDR_FRAME_Msk                 (_U_(0x1) << FLEX_US_IDR_FRAME_Pos)                  /**< (FLEX_US_IDR) Framing Error Interrupt Disable Mask */
#define FLEX_US_IDR_FRAME(value)              (FLEX_US_IDR_FRAME_Msk & ((value) << FLEX_US_IDR_FRAME_Pos))
#define FLEX_US_IDR_PARE_Pos                  _U_(7)                                               /**< (FLEX_US_IDR) Parity Error Interrupt Disable Position */
#define FLEX_US_IDR_PARE_Msk                  (_U_(0x1) << FLEX_US_IDR_PARE_Pos)                   /**< (FLEX_US_IDR) Parity Error Interrupt Disable Mask */
#define FLEX_US_IDR_PARE(value)               (FLEX_US_IDR_PARE_Msk & ((value) << FLEX_US_IDR_PARE_Pos))
#define FLEX_US_IDR_TIMEOUT_Pos               _U_(8)                                               /**< (FLEX_US_IDR) Timeout Interrupt Disable Position */
#define FLEX_US_IDR_TIMEOUT_Msk               (_U_(0x1) << FLEX_US_IDR_TIMEOUT_Pos)                /**< (FLEX_US_IDR) Timeout Interrupt Disable Mask */
#define FLEX_US_IDR_TIMEOUT(value)            (FLEX_US_IDR_TIMEOUT_Msk & ((value) << FLEX_US_IDR_TIMEOUT_Pos))
#define FLEX_US_IDR_TXEMPTY_Pos               _U_(9)                                               /**< (FLEX_US_IDR) TXEMPTY Interrupt Disable Position */
#define FLEX_US_IDR_TXEMPTY_Msk               (_U_(0x1) << FLEX_US_IDR_TXEMPTY_Pos)                /**< (FLEX_US_IDR) TXEMPTY Interrupt Disable Mask */
#define FLEX_US_IDR_TXEMPTY(value)            (FLEX_US_IDR_TXEMPTY_Msk & ((value) << FLEX_US_IDR_TXEMPTY_Pos))
#define FLEX_US_IDR_ITER_Pos                  _U_(10)                                              /**< (FLEX_US_IDR) Max Number of Repetitions Reached Interrupt Disable Position */
#define FLEX_US_IDR_ITER_Msk                  (_U_(0x1) << FLEX_US_IDR_ITER_Pos)                   /**< (FLEX_US_IDR) Max Number of Repetitions Reached Interrupt Disable Mask */
#define FLEX_US_IDR_ITER(value)               (FLEX_US_IDR_ITER_Msk & ((value) << FLEX_US_IDR_ITER_Pos))
#define FLEX_US_IDR_NACK_Pos                  _U_(13)                                              /**< (FLEX_US_IDR) Non Acknowledge Interrupt Disable Position */
#define FLEX_US_IDR_NACK_Msk                  (_U_(0x1) << FLEX_US_IDR_NACK_Pos)                   /**< (FLEX_US_IDR) Non Acknowledge Interrupt Disable Mask */
#define FLEX_US_IDR_NACK(value)               (FLEX_US_IDR_NACK_Msk & ((value) << FLEX_US_IDR_NACK_Pos))
#define FLEX_US_IDR_CTSIC_Pos                 _U_(19)                                              /**< (FLEX_US_IDR) Clear to Send Input Change Interrupt Disable Position */
#define FLEX_US_IDR_CTSIC_Msk                 (_U_(0x1) << FLEX_US_IDR_CTSIC_Pos)                  /**< (FLEX_US_IDR) Clear to Send Input Change Interrupt Disable Mask */
#define FLEX_US_IDR_CTSIC(value)              (FLEX_US_IDR_CTSIC_Msk & ((value) << FLEX_US_IDR_CTSIC_Pos))
#define FLEX_US_IDR_CMP_Pos                   _U_(22)                                              /**< (FLEX_US_IDR) Comparison Interrupt Disable Position */
#define FLEX_US_IDR_CMP_Msk                   (_U_(0x1) << FLEX_US_IDR_CMP_Pos)                    /**< (FLEX_US_IDR) Comparison Interrupt Disable Mask */
#define FLEX_US_IDR_CMP(value)                (FLEX_US_IDR_CMP_Msk & ((value) << FLEX_US_IDR_CMP_Pos))
#define FLEX_US_IDR_MANE_Pos                  _U_(24)                                              /**< (FLEX_US_IDR) Manchester Error Interrupt Disable Position */
#define FLEX_US_IDR_MANE_Msk                  (_U_(0x1) << FLEX_US_IDR_MANE_Pos)                   /**< (FLEX_US_IDR) Manchester Error Interrupt Disable Mask */
#define FLEX_US_IDR_MANE(value)               (FLEX_US_IDR_MANE_Msk & ((value) << FLEX_US_IDR_MANE_Pos))
#define FLEX_US_IDR_Msk                       _U_(0x014827E7)                                      /**< (FLEX_US_IDR) Register Mask  */

/* SPI mode */
#define FLEX_US_IDR_SPI_Msk                   _U_(0x00000000)                                       /**< (FLEX_US_IDR_SPI) Register Mask  */

