Microchip-MPLAB-Harmony/csp/apps/adc/adc_automatic_window_comparison/firmware/src/packs/ATSAMA5D27_DFP/component/flexcom.h
/* -------- FLEX_US_LINBRR : (FLEXCOM Offset: 0x25C) ( R/ 32) USART LIN Baud Rate Register -------- */
#define FLEX_US_LINBRR_LINCD_Pos              _U_(0)                                               /**< (FLEX_US_LINBRR) Clock Divider after Synchronization Position */
#define FLEX_US_LINBRR_LINCD_Msk              (_U_(0xFFFF) << FLEX_US_LINBRR_LINCD_Pos)            /**< (FLEX_US_LINBRR) Clock Divider after Synchronization Mask */
#define FLEX_US_LINBRR_LINCD(value)           (FLEX_US_LINBRR_LINCD_Msk & ((value) << FLEX_US_LINBRR_LINCD_Pos))
#define FLEX_US_LINBRR_LINFP_Pos              _U_(16)                                              /**< (FLEX_US_LINBRR) Fractional Part after Synchronization Position */
#define FLEX_US_LINBRR_LINFP_Msk              (_U_(0x7) << FLEX_US_LINBRR_LINFP_Pos)               /**< (FLEX_US_LINBRR) Fractional Part after Synchronization Mask */
#define FLEX_US_LINBRR_LINFP(value)           (FLEX_US_LINBRR_LINFP_Msk & ((value) << FLEX_US_LINBRR_LINFP_Pos))
#define FLEX_US_LINBRR_Msk                    _U_(0x0007FFFF)                                      /**< (FLEX_US_LINBRR) Register Mask  */


/* -------- FLEX_US_CMPR : (FLEXCOM Offset: 0x290) (R/W 32) USART Comparison Register -------- */
#define FLEX_US_CMPR_VAL1_Pos                 _U_(0)                                               /**< (FLEX_US_CMPR) First Comparison Value for Received Character Position */
#define FLEX_US_CMPR_VAL1_Msk                 (_U_(0x1FF) << FLEX_US_CMPR_VAL1_Pos)                /**< (FLEX_US_CMPR) First Comparison Value for Received Character Mask */
#define FLEX_US_CMPR_VAL1(value)              (FLEX_US_CMPR_VAL1_Msk & ((value) << FLEX_US_CMPR_VAL1_Pos))
#define FLEX_US_CMPR_CMPMODE_Pos              _U_(12)                                              /**< (FLEX_US_CMPR) Comparison Mode Position */
#define FLEX_US_CMPR_CMPMODE_Msk              (_U_(0x1) << FLEX_US_CMPR_CMPMODE_Pos)               /**< (FLEX_US_CMPR) Comparison Mode Mask */
#define FLEX_US_CMPR_CMPMODE(value)           (FLEX_US_CMPR_CMPMODE_Msk & ((value) << FLEX_US_CMPR_CMPMODE_Pos))
#define   FLEX_US_CMPR_CMPMODE_FLAG_ONLY_Val  _U_(0x0)                                             /**< (FLEX_US_CMPR) Any character is received and comparison function drives CMP flag.  */
#define   FLEX_US_CMPR_CMPMODE_START_CONDITION_Val _U_(0x1)                                             /**< (FLEX_US_CMPR) Comparison condition must be met to start reception.  */
#define FLEX_US_CMPR_CMPMODE_FLAG_ONLY        (FLEX_US_CMPR_CMPMODE_FLAG_ONLY_Val << FLEX_US_CMPR_CMPMODE_Pos) /**< (FLEX_US_CMPR) Any character is received and comparison function drives CMP flag. Position  */
#define FLEX_US_CMPR_CMPMODE_START_CONDITION  (FLEX_US_CMPR_CMPMODE_START_CONDITION_Val << FLEX_US_CMPR_CMPMODE_Pos) /**< (FLEX_US_CMPR) Comparison condition must be met to start reception. Position  */
#define FLEX_US_CMPR_CMPPAR_Pos               _U_(14)                                              /**< (FLEX_US_CMPR) Compare Parity Position */
#define FLEX_US_CMPR_CMPPAR_Msk               (_U_(0x1) << FLEX_US_CMPR_CMPPAR_Pos)                /**< (FLEX_US_CMPR) Compare Parity Mask */
#define FLEX_US_CMPR_CMPPAR(value)            (FLEX_US_CMPR_CMPPAR_Msk & ((value) << FLEX_US_CMPR_CMPPAR_Pos))
#define FLEX_US_CMPR_VAL2_Pos                 _U_(16)                                              /**< (FLEX_US_CMPR) Second Comparison Value for Received Character Position */
#define FLEX_US_CMPR_VAL2_Msk                 (_U_(0x1FF) << FLEX_US_CMPR_VAL2_Pos)                /**< (FLEX_US_CMPR) Second Comparison Value for Received Character Mask */
#define FLEX_US_CMPR_VAL2(value)              (FLEX_US_CMPR_VAL2_Msk & ((value) << FLEX_US_CMPR_VAL2_Pos))
#define FLEX_US_CMPR_Msk                      _U_(0x01FF51FF)                                      /**< (FLEX_US_CMPR) Register Mask  */


/* -------- FLEX_US_FMR : (FLEXCOM Offset: 0x2A0) (R/W 32) USART FIFO Mode Register -------- */
#define FLEX_US_FMR_TXRDYM_Pos                _U_(0)                                               /**< (FLEX_US_FMR) Transmitter Ready Mode Position */
#define FLEX_US_FMR_TXRDYM_Msk                (_U_(0x3) << FLEX_US_FMR_TXRDYM_Pos)                 /**< (FLEX_US_FMR) Transmitter Ready Mode Mask */
#define FLEX_US_FMR_TXRDYM(value)             (FLEX_US_FMR_TXRDYM_Msk & ((value) << FLEX_US_FMR_TXRDYM_Pos))
#define   FLEX_US_FMR_TXRDYM_ONE_DATA_Val     _U_(0x0)                                             /**< (FLEX_US_FMR) TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO  */
#define   FLEX_US_FMR_TXRDYM_TWO_DATA_Val     _U_(0x1)                                             /**< (FLEX_US_FMR) TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO  */
#define   FLEX_US_FMR_TXRDYM_FOUR_DATA_Val    _U_(0x2)                                             /**< (FLEX_US_FMR) TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO  */
#define FLEX_US_FMR_TXRDYM_ONE_DATA           (FLEX_US_FMR_TXRDYM_ONE_DATA_Val << FLEX_US_FMR_TXRDYM_Pos) /**< (FLEX_US_FMR) TXRDY will be at level '1' when at least one data can be written in the Transmit FIFO Position  */
#define FLEX_US_FMR_TXRDYM_TWO_DATA           (FLEX_US_FMR_TXRDYM_TWO_DATA_Val << FLEX_US_FMR_TXRDYM_Pos) /**< (FLEX_US_FMR) TXRDY will be at level '1' when at least two data can be written in the Transmit FIFO Position  */
#define FLEX_US_FMR_TXRDYM_FOUR_DATA          (FLEX_US_FMR_TXRDYM_FOUR_DATA_Val << FLEX_US_FMR_TXRDYM_Pos) /**< (FLEX_US_FMR) TXRDY will be at level '1' when at least four data can be written in the Transmit FIFO Position  */
#define FLEX_US_FMR_RXRDYM_Pos                _U_(4)                                               /**< (FLEX_US_FMR) Receiver Ready Mode Position */
#define FLEX_US_FMR_RXRDYM_Msk                (_U_(0x3) << FLEX_US_FMR_RXRDYM_Pos)                 /**< (FLEX_US_FMR) Receiver Ready Mode Mask */
#define FLEX_US_FMR_RXRDYM(value)             (FLEX_US_FMR_RXRDYM_Msk & ((value) << FLEX_US_FMR_RXRDYM_Pos))
#define   FLEX_US_FMR_RXRDYM_ONE_DATA_Val     _U_(0x0)                                             /**< (FLEX_US_FMR) RXRDY will be at level '1' when at least one unread data is in the Receive FIFO  */
#define   FLEX_US_FMR_RXRDYM_TWO_DATA_Val     _U_(0x1)                                             /**< (FLEX_US_FMR) RXRDY will be at level '1' when at least two unread data are in the Receive FIFO  */
#define   FLEX_US_FMR_RXRDYM_FOUR_DATA_Val    _U_(0x2)                                             /**< (FLEX_US_FMR) RXRDY will be at level '1' when at least four unread data are in the Receive FIFO  */
#define FLEX_US_FMR_RXRDYM_ONE_DATA           (FLEX_US_FMR_RXRDYM_ONE_DATA_Val << FLEX_US_FMR_RXRDYM_Pos) /**< (FLEX_US_FMR) RXRDY will be at level '1' when at least one unread data is in the Receive FIFO Position  */
#define FLEX_US_FMR_RXRDYM_TWO_DATA           (FLEX_US_FMR_RXRDYM_TWO_DATA_Val << FLEX_US_FMR_RXRDYM_Pos) /**< (FLEX_US_FMR) RXRDY will be at level '1' when at least two unread data are in the Receive FIFO Position  */
#define FLEX_US_FMR_RXRDYM_FOUR_DATA          (FLEX_US_FMR_RXRDYM_FOUR_DATA_Val << FLEX_US_FMR_RXRDYM_Pos) /**< (FLEX_US_FMR) RXRDY will be at level '1' when at least four unread data are in the Receive FIFO Position  */
#define FLEX_US_FMR_FRTSC_Pos                 _U_(7)                                               /**< (FLEX_US_FMR) FIFO RTS Pin Control enable (Hardware Handshaking mode only) Position */
#define FLEX_US_FMR_FRTSC_Msk                 (_U_(0x1) << FLEX_US_FMR_FRTSC_Pos)                  /**< (FLEX_US_FMR) FIFO RTS Pin Control enable (Hardware Handshaking mode only) Mask */
#define FLEX_US_FMR_FRTSC(value)              (FLEX_US_FMR_FRTSC_Msk & ((value) << FLEX_US_FMR_FRTSC_Pos))
#define FLEX_US_FMR_TXFTHRES_Pos              _U_(8)                                               /**< (FLEX_US_FMR) Transmit FIFO Threshold Position */
#define FLEX_US_FMR_TXFTHRES_Msk              (_U_(0x3F) << FLEX_US_FMR_TXFTHRES_Pos)              /**< (FLEX_US_FMR) Transmit FIFO Threshold Mask */
#define FLEX_US_FMR_TXFTHRES(value)           (FLEX_US_FMR_TXFTHRES_Msk & ((value) << FLEX_US_FMR_TXFTHRES_Pos))
#define FLEX_US_FMR_RXFTHRES_Pos              _U_(16)                                              /**< (FLEX_US_FMR) Receive FIFO Threshold Position */
#define FLEX_US_FMR_RXFTHRES_Msk              (_U_(0x3F) << FLEX_US_FMR_RXFTHRES_Pos)              /**< (FLEX_US_FMR) Receive FIFO Threshold Mask */
#define FLEX_US_FMR_RXFTHRES(value)           (FLEX_US_FMR_RXFTHRES_Msk & ((value) << FLEX_US_FMR_RXFTHRES_Pos))
#define FLEX_US_FMR_RXFTHRES2_Pos             _U_(24)                                              /**< (FLEX_US_FMR) Receive FIFO Threshold 2 Position */
#define FLEX_US_FMR_RXFTHRES2_Msk             (_U_(0x3F) << FLEX_US_FMR_RXFTHRES2_Pos)             /**< (FLEX_US_FMR) Receive FIFO Threshold 2 Mask */
#define FLEX_US_FMR_RXFTHRES2(value)          (FLEX_US_FMR_RXFTHRES2_Msk & ((value) << FLEX_US_FMR_RXFTHRES2_Pos))
#define FLEX_US_FMR_Msk                       _U_(0x3F3F3FB3)                                      /**< (FLEX_US_FMR) Register Mask  */


/* -------- FLEX_US_FLR : (FLEXCOM Offset: 0x2A4) ( R/ 32) USART FIFO Level Register -------- */
#define FLEX_US_FLR_TXFL_Pos                  _U_(0)                                               /**< (FLEX_US_FLR) Transmit FIFO Level Position */
#define FLEX_US_FLR_TXFL_Msk                  (_U_(0x3F) << FLEX_US_FLR_TXFL_Pos)                  /**< (FLEX_US_FLR) Transmit FIFO Level Mask */
#define FLEX_US_FLR_TXFL(value)               (FLEX_US_FLR_TXFL_Msk & ((value) << FLEX_US_FLR_TXFL_Pos))
#define FLEX_US_FLR_RXFL_Pos                  _U_(16)                                              /**< (FLEX_US_FLR) Receive FIFO Level Position */
#define FLEX_US_FLR_RXFL_Msk                  (_U_(0x3F) << FLEX_US_FLR_RXFL_Pos)                  /**< (FLEX_US_FLR) Receive FIFO Level Mask */
#define FLEX_US_FLR_RXFL(value)               (FLEX_US_FLR_RXFL_Msk & ((value) << FLEX_US_FLR_RXFL_Pos))
#define FLEX_US_FLR_Msk                       _U_(0x003F003F)                                      /**< (FLEX_US_FLR) Register Mask  */


/* -------- FLEX_US_FIER : (FLEXCOM Offset: 0x2A8) ( /W 32) USART FIFO Interrupt Enable Register -------- */
#define FLEX_US_FIER_TXFEF_Pos                _U_(0)                                               /**< (FLEX_US_FIER) TXFEF Interrupt Enable Position */
#define FLEX_US_FIER_TXFEF_Msk                (_U_(0x1) << FLEX_US_FIER_TXFEF_Pos)                 /**< (FLEX_US_FIER) TXFEF Interrupt Enable Mask */
#define FLEX_US_FIER_TXFEF(value)             (FLEX_US_FIER_TXFEF_Msk & ((value) << FLEX_US_FIER_TXFEF_Pos))
#define FLEX_US_FIER_TXFFF_Pos                _U_(1)                                               /**< (FLEX_US_FIER) TXFFF Interrupt Enable Position */
#define FLEX_US_FIER_TXFFF_Msk                (_U_(0x1) << FLEX_US_FIER_TXFFF_Pos)                 /**< (FLEX_US_FIER) TXFFF Interrupt Enable Mask */
#define FLEX_US_FIER_TXFFF(value)             (FLEX_US_FIER_TXFFF_Msk & ((value) << FLEX_US_FIER_TXFFF_Pos))
#define FLEX_US_FIER_TXFTHF_Pos               _U_(2)                                               /**< (FLEX_US_FIER) TXFTHF Interrupt Enable Position */
#define FLEX_US_FIER_TXFTHF_Msk               (_U_(0x1) << FLEX_US_FIER_TXFTHF_Pos)                /**< (FLEX_US_FIER) TXFTHF Interrupt Enable Mask */
#define FLEX_US_FIER_TXFTHF(value)            (FLEX_US_FIER_TXFTHF_Msk & ((value) << FLEX_US_FIER_TXFTHF_Pos))
#define FLEX_US_FIER_RXFEF_Pos                _U_(3)                                               /**< (FLEX_US_FIER) RXFEF Interrupt Enable Position */
#define FLEX_US_FIER_RXFEF_Msk                (_U_(0x1) << FLEX_US_FIER_RXFEF_Pos)                 /**< (FLEX_US_FIER) RXFEF Interrupt Enable Mask */
#define FLEX_US_FIER_RXFEF(value)             (FLEX_US_FIER_RXFEF_Msk & ((value) << FLEX_US_FIER_RXFEF_Pos))
#define FLEX_US_FIER_RXFFF_Pos                _U_(4)                                               /**< (FLEX_US_FIER) RXFFF Interrupt Enable Position */
#define FLEX_US_FIER_RXFFF_Msk                (_U_(0x1) << FLEX_US_FIER_RXFFF_Pos)                 /**< (FLEX_US_FIER) RXFFF Interrupt Enable Mask */
#define FLEX_US_FIER_RXFFF(value)             (FLEX_US_FIER_RXFFF_Msk & ((value) << FLEX_US_FIER_RXFFF_Pos))
#define FLEX_US_FIER_RXFTHF_Pos               _U_(5)                                               /**< (FLEX_US_FIER) RXFTHF Interrupt Enable Position */
#define FLEX_US_FIER_RXFTHF_Msk               (_U_(0x1) << FLEX_US_FIER_RXFTHF_Pos)                /**< (FLEX_US_FIER) RXFTHF Interrupt Enable Mask */
#define FLEX_US_FIER_RXFTHF(value)            (FLEX_US_FIER_RXFTHF_Msk & ((value) << FLEX_US_FIER_RXFTHF_Pos))
#define FLEX_US_FIER_TXFPTEF_Pos              _U_(6)                                               /**< (FLEX_US_FIER) TXFPTEF Interrupt Enable Position */
#define FLEX_US_FIER_TXFPTEF_Msk              (_U_(0x1) << FLEX_US_FIER_TXFPTEF_Pos)               /**< (FLEX_US_FIER) TXFPTEF Interrupt Enable Mask */
#define FLEX_US_FIER_TXFPTEF(value)           (FLEX_US_FIER_TXFPTEF_Msk & ((value) << FLEX_US_FIER_TXFPTEF_Pos))
#define FLEX_US_FIER_RXFPTEF_Pos              _U_(7)                                               /**< (FLEX_US_FIER) RXFPTEF Interrupt Enable Position */
#define FLEX_US_FIER_RXFPTEF_Msk              (_U_(0x1) << FLEX_US_FIER_RXFPTEF_Pos)               /**< (FLEX_US_FIER) RXFPTEF Interrupt Enable Mask */
#define FLEX_US_FIER_RXFPTEF(value)           (FLEX_US_FIER_RXFPTEF_Msk & ((value) << FLEX_US_FIER_RXFPTEF_Pos))
#define FLEX_US_FIER_RXFTHF2_Pos              _U_(9)                                               /**< (FLEX_US_FIER) RXFTHF2 Interrupt Enable Position */
#define FLEX_US_FIER_RXFTHF2_Msk              (_U_(0x1) << FLEX_US_FIER_RXFTHF2_Pos)               /**< (FLEX_US_FIER) RXFTHF2 Interrupt Enable Mask */
#define FLEX_US_FIER_RXFTHF2(value)           (FLEX_US_FIER_RXFTHF2_Msk & ((value) << FLEX_US_FIER_RXFTHF2_Pos))
#define FLEX_US_FIER_Msk                      _U_(0x000002FF)                                      /**< (FLEX_US_FIER) Register Mask  */


/* -------- FLEX_US_FIDR : (FLEXCOM Offset: 0x2AC) ( /W 32) USART FIFO Interrupt Disable Register -------- */
#define FLEX_US_FIDR_TXFEF_Pos                _U_(0)                                               /**< (FLEX_US_FIDR) TXFEF Interrupt Disable Position */
#define FLEX_US_FIDR_TXFEF_Msk                (_U_(0x1) << FLEX_US_FIDR_TXFEF_Pos)                 /**< (FLEX_US_FIDR) TXFEF Interrupt Disable Mask */
#define FLEX_US_FIDR_TXFEF(value)             (FLEX_US_FIDR_TXFEF_Msk & ((value) << FLEX_US_FIDR_TXFEF_Pos))
#define FLEX_US_FIDR_TXFFF_Pos                _U_(1)                                               /**< (FLEX_US_FIDR) TXFFF Interrupt Disable Position */
#define FLEX_US_FIDR_TXFFF_Msk                (_U_(0x1) << FLEX_US_FIDR_TXFFF_Pos)                 /**< (FLEX_US_FIDR) TXFFF Interrupt Disable Mask */
#define FLEX_US_FIDR_TXFFF(value)             (FLEX_US_FIDR_TXFFF_Msk & ((value) << FLEX_US_FIDR_TXFFF_Pos))
#define FLEX_US_FIDR_TXFTHF_Pos               _U_(2)                                               /**< (FLEX_US_FIDR) TXFTHF Interrupt Disable Position */
#define FLEX_US_FIDR_TXFTHF_Msk               (_U_(0x1) << FLEX_US_FIDR_TXFTHF_Pos)                /**< (FLEX_US_FIDR) TXFTHF Interrupt Disable Mask */
#define FLEX_US_FIDR_TXFTHF(value)            (FLEX_US_FIDR_TXFTHF_Msk & ((value) << FLEX_US_FIDR_TXFTHF_Pos))
#define FLEX_US_FIDR_RXFEF_Pos                _U_(3)                                               /**< (FLEX_US_FIDR) RXFEF Interrupt Disable Position */
#define FLEX_US_FIDR_RXFEF_Msk                (_U_(0x1) << FLEX_US_FIDR_RXFEF_Pos)                 /**< (FLEX_US_FIDR) RXFEF Interrupt Disable Mask */
#define FLEX_US_FIDR_RXFEF(value)             (FLEX_US_FIDR_RXFEF_Msk & ((value) << FLEX_US_FIDR_RXFEF_Pos))
#define FLEX_US_FIDR_RXFFF_Pos                _U_(4)                                               /**< (FLEX_US_FIDR) RXFFF Interrupt Disable Position */
#define FLEX_US_FIDR_RXFFF_Msk                (_U_(0x1) << FLEX_US_FIDR_RXFFF_Pos)                 /**< (FLEX_US_FIDR) RXFFF Interrupt Disable Mask */
#define FLEX_US_FIDR_RXFFF(value)             (FLEX_US_FIDR_RXFFF_Msk & ((value) << FLEX_US_FIDR_RXFFF_Pos))
#define FLEX_US_FIDR_RXFTHF_Pos               _U_(5)                                               /**< (FLEX_US_FIDR) RXFTHF Interrupt Disable Position */
#define FLEX_US_FIDR_RXFTHF_Msk               (_U_(0x1) << FLEX_US_FIDR_RXFTHF_Pos)                /**< (FLEX_US_FIDR) RXFTHF Interrupt Disable Mask */
#define FLEX_US_FIDR_RXFTHF(value)            (FLEX_US_FIDR_RXFTHF_Msk & ((value) << FLEX_US_FIDR_RXFTHF_Pos))
#define FLEX_US_FIDR_TXFPTEF_Pos              _U_(6)                                               /**< (FLEX_US_FIDR) TXFPTEF Interrupt Disable Position */
#define FLEX_US_FIDR_TXFPTEF_Msk              (_U_(0x1) << FLEX_US_FIDR_TXFPTEF_Pos)               /**< (FLEX_US_FIDR) TXFPTEF Interrupt Disable Mask */
#define FLEX_US_FIDR_TXFPTEF(value)           (FLEX_US_FIDR_TXFPTEF_Msk & ((value) << FLEX_US_FIDR_TXFPTEF_Pos))
#define FLEX_US_FIDR_RXFPTEF_Pos              _U_(7)                                               /**< (FLEX_US_FIDR) RXFPTEF Interrupt Disable Position */
#define FLEX_US_FIDR_RXFPTEF_Msk              (_U_(0x1) << FLEX_US_FIDR_RXFPTEF_Pos)               /**< (FLEX_US_FIDR) RXFPTEF Interrupt Disable Mask */
#define FLEX_US_FIDR_RXFPTEF(value)           (FLEX_US_FIDR_RXFPTEF_Msk & ((value) << FLEX_US_FIDR_RXFPTEF_Pos))
#define FLEX_US_FIDR_RXFTHF2_Pos              _U_(9)                                               /**< (FLEX_US_FIDR) RXFTHF2 Interrupt Disable Position */
#define FLEX_US_FIDR_RXFTHF2_Msk              (_U_(0x1) << FLEX_US_FIDR_RXFTHF2_Pos)               /**< (FLEX_US_FIDR) RXFTHF2 Interrupt Disable Mask */
#define FLEX_US_FIDR_RXFTHF2(value)           (FLEX_US_FIDR_RXFTHF2_Msk & ((value) << FLEX_US_FIDR_RXFTHF2_Pos))
#define FLEX_US_FIDR_Msk                      _U_(0x000002FF)                                      /**< (FLEX_US_FIDR) Register Mask  */


/* -------- FLEX_US_FIMR : (FLEXCOM Offset: 0x2B0) ( R/ 32) USART FIFO Interrupt Mask Register -------- */
#define FLEX_US_FIMR_TXFEF_Pos                _U_(0)                                               /**< (FLEX_US_FIMR) TXFEF Interrupt Mask Position */
#define FLEX_US_FIMR_TXFEF_Msk                (_U_(0x1) << FLEX_US_FIMR_TXFEF_Pos)                 /**< (FLEX_US_FIMR) TXFEF Interrupt Mask Mask */
#define FLEX_US_FIMR_TXFEF(value)             (FLEX_US_FIMR_TXFEF_Msk & ((value) << FLEX_US_FIMR_TXFEF_Pos))
#define FLEX_US_FIMR_TXFFF_Pos                _U_(1)                                               /**< (FLEX_US_FIMR) TXFFF Interrupt Mask Position */
#define FLEX_US_FIMR_TXFFF_Msk                (_U_(0x1) << FLEX_US_FIMR_TXFFF_Pos)                 /**< (FLEX_US_FIMR) TXFFF Interrupt Mask Mask */
#define FLEX_US_FIMR_TXFFF(value)             (FLEX_US_FIMR_TXFFF_Msk & ((value) << FLEX_US_FIMR_TXFFF_Pos))
#define FLEX_US_FIMR_TXFTHF_Pos               _U_(2)                                               /**< (FLEX_US_FIMR) TXFTHF Interrupt Mask Position */
#define FLEX_US_FIMR_TXFTHF_Msk               (_U_(0x1) << FLEX_US_FIMR_TXFTHF_Pos)                /**< (FLEX_US_FIMR) TXFTHF Interrupt Mask Mask */
#define FLEX_US_FIMR_TXFTHF(value)            (FLEX_US_FIMR_TXFTHF_Msk & ((value) << FLEX_US_FIMR_TXFTHF_Pos))
#define FLEX_US_FIMR_RXFEF_Pos                _U_(3)                                               /**< (FLEX_US_FIMR) RXFEF Interrupt Mask Position */
#define FLEX_US_FIMR_RXFEF_Msk                (_U_(0x1) << FLEX_US_FIMR_RXFEF_Pos)                 /**< (FLEX_US_FIMR) RXFEF Interrupt Mask Mask */
#define FLEX_US_FIMR_RXFEF(value)             (FLEX_US_FIMR_RXFEF_Msk & ((value) << FLEX_US_FIMR_RXFEF_Pos))
#define FLEX_US_FIMR_RXFFF_Pos                _U_(4)                                               /**< (FLEX_US_FIMR) RXFFF Interrupt Mask Position */
#define FLEX_US_FIMR_RXFFF_Msk                (_U_(0x1) << FLEX_US_FIMR_RXFFF_Pos)                 /**< (FLEX_US_FIMR) RXFFF Interrupt Mask Mask */
#define FLEX_US_FIMR_RXFFF(value)             (FLEX_US_FIMR_RXFFF_Msk & ((value) << FLEX_US_FIMR_RXFFF_Pos))
#define FLEX_US_FIMR_RXFTHF_Pos               _U_(5)                                               /**< (FLEX_US_FIMR) RXFTHF Interrupt Mask Position */
#define FLEX_US_FIMR_RXFTHF_Msk               (_U_(0x1) << FLEX_US_FIMR_RXFTHF_Pos)                /**< (FLEX_US_FIMR) RXFTHF Interrupt Mask Mask */
#define FLEX_US_FIMR_RXFTHF(value)            (FLEX_US_FIMR_RXFTHF_Msk & ((value) << FLEX_US_FIMR_RXFTHF_Pos))
#define FLEX_US_FIMR_TXFPTEF_Pos              _U_(6)                                               /**< (FLEX_US_FIMR) TXFPTEF Interrupt Mask Position */
#define FLEX_US_FIMR_TXFPTEF_Msk              (_U_(0x1) << FLEX_US_FIMR_TXFPTEF_Pos)               /**< (FLEX_US_FIMR) TXFPTEF Interrupt Mask Mask */
#define FLEX_US_FIMR_TXFPTEF(value)           (FLEX_US_FIMR_TXFPTEF_Msk & ((value) << FLEX_US_FIMR_TXFPTEF_Pos))
#define FLEX_US_FIMR_RXFPTEF_Pos              _U_(7)                                               /**< (FLEX_US_FIMR) RXFPTEF Interrupt Mask Position */
#define FLEX_US_FIMR_RXFPTEF_Msk              (_U_(0x1) << FLEX_US_FIMR_RXFPTEF_Pos)               /**< (FLEX_US_FIMR) RXFPTEF Interrupt Mask Mask */
#define FLEX_US_FIMR_RXFPTEF(value)           (FLEX_US_FIMR_RXFPTEF_Msk & ((value) << FLEX_US_FIMR_RXFPTEF_Pos))
#define FLEX_US_FIMR_RXFTHF2_Pos              _U_(9)                                               /**< (FLEX_US_FIMR) RXFTHF2 Interrupt Mask Position */
#define FLEX_US_FIMR_RXFTHF2_Msk              (_U_(0x1) << FLEX_US_FIMR_RXFTHF2_Pos)               /**< (FLEX_US_FIMR) RXFTHF2 Interrupt Mask Mask */
#define FLEX_US_FIMR_RXFTHF2(value)           (FLEX_US_FIMR_RXFTHF2_Msk & ((value) << FLEX_US_FIMR_RXFTHF2_Pos))
#define FLEX_US_FIMR_Msk                      _U_(0x000002FF)                                      /**< (FLEX_US_FIMR) Register Mask  */


