Microchip-MPLAB-Harmony/csp/apps/adc/adc_automatic_window_comparison/firmware/src/packs/ATSAMA5D27_DFP/component/flexcom.h
/* -------- FLEX_US_FESR : (FLEXCOM Offset: 0x2B4) ( R/ 32) USART FIFO Event Status Register -------- */
#define FLEX_US_FESR_TXFEF_Pos                _U_(0)                                               /**< (FLEX_US_FESR) Transmit FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Position */
#define FLEX_US_FESR_TXFEF_Msk                (_U_(0x1) << FLEX_US_FESR_TXFEF_Pos)                 /**< (FLEX_US_FESR) Transmit FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Mask */
#define FLEX_US_FESR_TXFEF(value)             (FLEX_US_FESR_TXFEF_Msk & ((value) << FLEX_US_FESR_TXFEF_Pos))
#define FLEX_US_FESR_TXFFF_Pos                _U_(1)                                               /**< (FLEX_US_FESR) Transmit FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Position */
#define FLEX_US_FESR_TXFFF_Msk                (_U_(0x1) << FLEX_US_FESR_TXFFF_Pos)                 /**< (FLEX_US_FESR) Transmit FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Mask */
#define FLEX_US_FESR_TXFFF(value)             (FLEX_US_FESR_TXFFF_Msk & ((value) << FLEX_US_FESR_TXFFF_Pos))
#define FLEX_US_FESR_TXFTHF_Pos               _U_(2)                                               /**< (FLEX_US_FESR) Transmit FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Position */
#define FLEX_US_FESR_TXFTHF_Msk               (_U_(0x1) << FLEX_US_FESR_TXFTHF_Pos)                /**< (FLEX_US_FESR) Transmit FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Mask */
#define FLEX_US_FESR_TXFTHF(value)            (FLEX_US_FESR_TXFTHF_Msk & ((value) << FLEX_US_FESR_TXFTHF_Pos))
#define FLEX_US_FESR_RXFEF_Pos                _U_(3)                                               /**< (FLEX_US_FESR) Receive FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Position */
#define FLEX_US_FESR_RXFEF_Msk                (_U_(0x1) << FLEX_US_FESR_RXFEF_Pos)                 /**< (FLEX_US_FESR) Receive FIFO Empty Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Mask */
#define FLEX_US_FESR_RXFEF(value)             (FLEX_US_FESR_RXFEF_Msk & ((value) << FLEX_US_FESR_RXFEF_Pos))
#define FLEX_US_FESR_RXFFF_Pos                _U_(4)                                               /**< (FLEX_US_FESR) Receive FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Position */
#define FLEX_US_FESR_RXFFF_Msk                (_U_(0x1) << FLEX_US_FESR_RXFFF_Pos)                 /**< (FLEX_US_FESR) Receive FIFO Full Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Mask */
#define FLEX_US_FESR_RXFFF(value)             (FLEX_US_FESR_RXFFF_Msk & ((value) << FLEX_US_FESR_RXFFF_Pos))
#define FLEX_US_FESR_RXFTHF_Pos               _U_(5)                                               /**< (FLEX_US_FESR) Receive FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Position */
#define FLEX_US_FESR_RXFTHF_Msk               (_U_(0x1) << FLEX_US_FESR_RXFTHF_Pos)                /**< (FLEX_US_FESR) Receive FIFO Threshold Flag (cleared by writing the FLEX_US_CR.RSTSTA bit) Mask */
#define FLEX_US_FESR_RXFTHF(value)            (FLEX_US_FESR_RXFTHF_Msk & ((value) << FLEX_US_FESR_RXFTHF_Pos))
#define FLEX_US_FESR_TXFPTEF_Pos              _U_(6)                                               /**< (FLEX_US_FESR) Transmit FIFO Pointer Error Flag Position */
#define FLEX_US_FESR_TXFPTEF_Msk              (_U_(0x1) << FLEX_US_FESR_TXFPTEF_Pos)               /**< (FLEX_US_FESR) Transmit FIFO Pointer Error Flag Mask */
#define FLEX_US_FESR_TXFPTEF(value)           (FLEX_US_FESR_TXFPTEF_Msk & ((value) << FLEX_US_FESR_TXFPTEF_Pos))
#define FLEX_US_FESR_RXFPTEF_Pos              _U_(7)                                               /**< (FLEX_US_FESR) Receive FIFO Pointer Error Flag Position */
#define FLEX_US_FESR_RXFPTEF_Msk              (_U_(0x1) << FLEX_US_FESR_RXFPTEF_Pos)               /**< (FLEX_US_FESR) Receive FIFO Pointer Error Flag Mask */
#define FLEX_US_FESR_RXFPTEF(value)           (FLEX_US_FESR_RXFPTEF_Msk & ((value) << FLEX_US_FESR_RXFPTEF_Pos))
#define FLEX_US_FESR_TXFLOCK_Pos              _U_(8)                                               /**< (FLEX_US_FESR) Transmit FIFO Lock Position */
#define FLEX_US_FESR_TXFLOCK_Msk              (_U_(0x1) << FLEX_US_FESR_TXFLOCK_Pos)               /**< (FLEX_US_FESR) Transmit FIFO Lock Mask */
#define FLEX_US_FESR_TXFLOCK(value)           (FLEX_US_FESR_TXFLOCK_Msk & ((value) << FLEX_US_FESR_TXFLOCK_Pos))
#define FLEX_US_FESR_RXFTHF2_Pos              _U_(9)                                               /**< (FLEX_US_FESR) Receive FIFO Threshold Flag 2 (cleared by writing the FLEX_US_CR.RSTSTA bit) Position */
#define FLEX_US_FESR_RXFTHF2_Msk              (_U_(0x1) << FLEX_US_FESR_RXFTHF2_Pos)               /**< (FLEX_US_FESR) Receive FIFO Threshold Flag 2 (cleared by writing the FLEX_US_CR.RSTSTA bit) Mask */
#define FLEX_US_FESR_RXFTHF2(value)           (FLEX_US_FESR_RXFTHF2_Msk & ((value) << FLEX_US_FESR_RXFTHF2_Pos))
#define FLEX_US_FESR_Msk                      _U_(0x000003FF)                                      /**< (FLEX_US_FESR) Register Mask  */


/* -------- FLEX_US_WPMR : (FLEXCOM Offset: 0x2E4) (R/W 32) USART Write Protection Mode Register -------- */
#define FLEX_US_WPMR_WPEN_Pos                 _U_(0)                                               /**< (FLEX_US_WPMR) Write Protection Enable Position */
#define FLEX_US_WPMR_WPEN_Msk                 (_U_(0x1) << FLEX_US_WPMR_WPEN_Pos)                  /**< (FLEX_US_WPMR) Write Protection Enable Mask */
#define FLEX_US_WPMR_WPEN(value)              (FLEX_US_WPMR_WPEN_Msk & ((value) << FLEX_US_WPMR_WPEN_Pos))
#define FLEX_US_WPMR_WPKEY_Pos                _U_(8)                                               /**< (FLEX_US_WPMR) Write Protection Key Position */
#define FLEX_US_WPMR_WPKEY_Msk                (_U_(0xFFFFFF) << FLEX_US_WPMR_WPKEY_Pos)            /**< (FLEX_US_WPMR) Write Protection Key Mask */
#define FLEX_US_WPMR_WPKEY(value)             (FLEX_US_WPMR_WPKEY_Msk & ((value) << FLEX_US_WPMR_WPKEY_Pos))
#define   FLEX_US_WPMR_WPKEY_PASSWD_Val       _U_(0x555341)                                        /**< (FLEX_US_WPMR) Writing any other value in this field aborts the write operation of bit WPEN. Always reads as 0.  */
#define FLEX_US_WPMR_WPKEY_PASSWD             (FLEX_US_WPMR_WPKEY_PASSWD_Val << FLEX_US_WPMR_WPKEY_Pos) /**< (FLEX_US_WPMR) Writing any other value in this field aborts the write operation of bit WPEN. Always reads as 0. Position  */
#define FLEX_US_WPMR_Msk                      _U_(0xFFFFFF01)                                      /**< (FLEX_US_WPMR) Register Mask  */


